package ru.otus.otuskotlin.coins.dsl

// Справочники. Возможно должны подгружаться из БД или файлов.

val sectionsMap = mapOf(
    1 to "Курсовые монеты РСФСР 1921 - 1923 гг.",
    2 to "Курсовые монеты РСФСР 1924 - 1991 гг.",
    3 to "Памятные и инвестиционные монеты СССР 1924 - 1991 гг.",
    4 to "Курсовые монет Российской Федерации с 1992 года.",
    5 to "Памятные и инвестиционные монеты Российской Федерации с 1992 года.",
)

val metalMap = mapOf(
    0 to "Медно-никелевые сплавы",
    1 to "Серебро",
    2 to "Золото",
    3 to "Платина",
    4 to "Палладий",
    5 to "Прочие",
    6 to "Золото и серебро",
    7 to "Сталь с латунным гальваническим покрытием",
)

val nominalMap = mapOf(
    "00" to "полкопейки",
    "01" to "1 копейка",
    "02" to "2 копейки",
    "03" to "3 копейки",
    "04" to "5 копеек",
    "05" to "10 копеек",
    "06" to "15 копеек",
    "07" to "20 копеек",
    "08" to "50 копеек",
    "09" to "1 рубль",
    "10" to "2 рубля",
    "11" to "3 рубля",
    "12" to "5 рублей",
    "13" to "червонец",
    "14" to "10 рублей",
    "15" to "25 рублей",
    "16" to "50 рублей",
    "17" to "100 рублей",
    "18" to "150 рублей",
    "19" to "200 рублей",
    "20" to "1000 рублей",
    "21" to "10000 рублей",
    "22" to "20 рублей",
    "23" to "500 рублей",
    "24" to "5000 рублей",
    "25" to "25000 рублей",
    "26" to "50000 рублей",
)
